<?php
	$title = 'אודות';
	$css_links = '<link rel="stylesheet" href="css/about.css">';
	require 'header.php';
?>

<div class="background">
	<div class="transbox">
		<p>
			<h1 id="content"> אודות </h1>
		</p>
	</div>
</div>
<br> <br>
<p>
	<br> <br>
	ברוכים הבאים <br> <br>
	.רצינו לספרהלך קצת איך התחיל בכלל <br><br>
	.אנו 3 סטודנטיות, דניאלה מושייב, ניקול יצחקוב וסיון דני שנאלצו במסגרת התואר למערכות מידע לעשות פרויקט גמר<br> <br>
	,ידענו בבירור שהפרויקט שלנו יהיה על חיות מחמד <br> <br>
	.אז ישבנו וחשבנו והעלנו בעיות יומיומיות שאנו נתקלות בהם כבעלות חיות מחמד<br> <br>
	למעשה, הבעיה הראשונה שעלתה היא שקשה מאוד לתכנן חופשות, הן קצרות והן ארוכות כי אין איפה להשאיר את החבר מחמד שלנו. <br> <br>
	ועוד יותר נורא, מקרים לא מתוכננים בהם אנו נאלצים להעדר בפתאומיות לתקופה לא מוגדרת.<br> <br>
	הבעיה הזו הגתה את הרעיון עומד מאחורי פלטפורמת PETSITTER.<br> <br>
	פלטפורמת PETSITTER זוהי פלטפורמה חינמית וחברתית שנועדה לעזור לנו, למגדלי חיות המחמד לעזור אחד לשני במצבים כאלה. <br> <br>
	מקוות שנצליח ליצור פה קהילה חברית עוזרת.<br> <br>


</p>
 <br><br>

<?php 
		$js_links = '';
		require 'footer.php'; 
	?>