<?php
	if (session_status() == PHP_SESSION_NONE) {
        session_start();
    }
	require_once 'include/dbh.inc.php';
	require_once 'include/check-user-registration.php';
	require_once 'gocoder.php';
  
    if(!isset($_SESSION['user-id']) || !isset($_GET['id'])){
        header('Location: volunteer.php');
    }

    $volunteer_id = $_GET['id'];

    $sql = "SELECT id, DATE_FORMAT(from_date,'%d/%m/%Y') AS from_date, DATE_FORMAT(from_hour, '%k:%i') AS from_hour, DATE_FORMAT(to_date,'%d/%m/%Y') AS to_date, DATE_FORMAT(to_hour, '%k:%i') AS to_hour 
            FROM volunteers 
            WHERE user_id = $volunteer_id AND DATE(NOW()) < DATE(to_date)
            AND is_request = 0
            ORDER BY from_date";
    $volunteers = $conn->query($sql);
    if ($volunteers->num_rows > 0) {
        $dateArr = array();
        while($row = $volunteers->fetch_assoc()) {
            $data_id = $row['id'];
            $from_date = $row['from_date'];
            $from_hour = $row['from_hour'];
            $to_date = $row['to_date'];
            $to_hour = $row['to_hour'];
            $date = "<li value='$data_id'><a href='#'>$from_date - $to_date $from_hour - $to_hour</a></li>";
            array_push($dateArr, $date);
        }		
        $dropdown_items = implode("", $dateArr);
    } else {
        header('Location: volunteer.php');
    }

    $title = 'טופס בקשה למתנדב/ת';
    $css_links = '<link rel="stylesheet" href="css/Contract.css">';
    require 'header.php';
        
?>
    <div class="background">
        <div class="transbox">
            <p>
                <h1 id="content"> טופס בקשה למתנדב/ת</h1>
            </p>
        </div>
    </div>
    <br />
    <br />
    <br />
    <br />
    <form action="include/contract.inc.php" method="post">
        <input type="hidden" id="date-id" name="date-id" value="0">
        <p id="date"> אנא בחרו תאריך מהתאריכים פנויים של המתנדב </p>
        <div class="dropdown">
            <button class="btn btn-primary dropdown-picker dropdown-toggle" type="button" data-toggle="dropdown">בחר
                <span class="caret"></span></button>
            <ul class="dropdown-menu d">
                <?php echo $dropdown_items ?>
            </ul>
        </div>

        <h3>תקנון החברה </h3>
        <textarea id="content" rows="7" cols="67">
    1. כללי
1.1. האמור בתקנון זה מתייחס באופן שווה לבני שני המינים, והשימוש בלשון זכר הוא מטעמי נוחות בלבד.
1.2. הוראות תקנון זה יחולו על כל שימוש שייעשה על ידך באתר, לרבות כל רכישה שתתבצע על ידך באמצעות האתר.
1.3. כל שימוש באתר, לרבות רכישה שתתבצע על ידך באמצעות האתר, מהווה את הסכמתך לקבל ולנהוג לפי תקנון זה.
1.4. החברה רשאית בכל עת, על פי שיקול דעתה הבלעדי, לשנות תקנון זה.
1.5. אין באמור בתקנון זה כדי לגרוע מהוראות חוק הגנת הצרכן, התשמ"א-1981 (להלן: "חוק הגנת הצרכן") והתקנות אשר הותקנו מכוחו, ככל שהן חלות על האתר (להלן: "ההוראות"), למעט במקרים בהם ניתן להתנות על הוראות כאמור והתניה כאמור בוצעה, במסגרת פעילות האתר אם במפורש או במשתמע.
1.6. למען הסר ספק, בהירשמות לקבלת "ההצעה היומית" אתה נותן את הסכמתך לקבל דואר אלקטרוני, לרבות דואר אלקטרוני שמטרתו לעודד רכישת מוצר או שירות, מהאתר. כמו-כן, אתה רשאי, בכל עת, להודיע לחברה על סירובך לקבל כל דואר אלקטרוני מהאתר, לרבות ע"י שליחת הודעה ל: iska43@inter.net.il.
1.7. כותרות הפרקים מובאות לשם נוחות והתמצאות המשתמש ולא ישמשו בפרשנות התקנון.
2. מי רשאי להשתמש באתר
2.1. כל אדם, לרבות חברה, רשאי להשתמש באתר, לרבות לבצע רכישות באמצעות האתר, בכפוף למילוי התנאים המצטברים המפורטים להלן:

• המשתמש הנו כשיר לבצע פעולות משפטיות מחייבות;
• למשתמש מלאו 18 שנים;
• המשתמש הנו בעל תעודת זהות ישראלית תקפה;
• המשתמש הוא בעל כתובת בישראל;
• המשתמש הוא בעל תא דואר אלקטרוני ברשת האינטרנט;
• המשתמש הנו בעל כרטיס אשראי ישראלי תקף ,שהונפק בישראל ע"י אחת מחברות כרטיסי האשראי.
2.2. מבלי לגרוע מהאמור לעיל, תהא החברה רשאית למנוע מכל אדם להשתמש באתר, באופן זמני או לצמיתות, וזאת על פי שיקול דעתה הבלעדי ומבלי למסור הודעה על כך מראש, לרבות בכל אחד מהמקרים הבאים:
• המשתמש ביצע מעשה בלתי חוקי ו/או עבר על הוראות הדין;
• המשתמש הפר תנאי מתנאי תקנון זה;
• המשתמש מסר בעת ההרשמה ו/או לאחר מכן פרטים שגויים במתכוון;
• המשתמש ביצע מעשה או מחדל שיש בו כדי לפגוע בחברה ו/או במי מטעמה ו/או בפעילותו התקינה של האתר ו/או במי מהספקים ו/או בצד ג' כלשהו;
• אם כרטיס האשראי שברשות המשתמש נחסם או הוגבל לשימוש בדרך כלשהי;
• בכוונת המשתמש לשוב ולמכור את השוברים, השירותים ו/או המוצרים שנרכשו באמצעות האתר לצד ג'.

3. המכירה ותנאי המכירה
3.1. באמצעות האתר ספקים יכולים להציע למכירה קבוצתית שוברים הניתנים להמרה לשירותים ו/או מוצרים של הספקים.
3.2. השוברים שניתן לרכוש מהספקים באמצעות האתר הינם לצורכי שיווק ופרסום הספקים, השירותים ו/או המוצרים. המחירים המוצעים הינם אטרקטיביים, אולם אינם משקפים בהכרח את המחיר הנמוך ביותר בשוק. "השווי" המוצג בנוגע לכל הצעה יומית הוא כפי שנמסר לחברה ע"י הספקים השונים ובאחריותם בלבד.
3.3. המכירה תהא מוגבלת בזמן, תלויה במספר מינימלי של רוכשים, ולעיתים אף מוגבלת במספר מקסימלי של רוכשים.
3.4. השובר שנרכש ניתן להמרה לשירותים ו/או למוצרים של הספק בהתאם לשובר הרלוונטי. כל השוברים יהיו כפופים לכל התנאים וההתניות, שייקבעו על-ידי החברה והספקים והנכללים באתר, לרבות בשובר הרלוונטי, ובתקנון הספק.
3.5. משמעות הלחיצה על כפתור ה - "קנה", וסיום ההליכים הנלווים לרכישה, לרבות הליך התשלום, היא שהמשתמש הציע הצעה לרכוש השירות ו/או המוצר הרלוונטי מהספק בהתאם לכל התנאים וההתניות, שייקבעו על ידי החברה והספק והנכללים באתר, לרבות בשובר הרלוונטי. למען הסר ספק, אין כל ודאות ו/או חובה כי הצעתו של משתמש תאושר והעסקה תושלם, לרבות במקרים שהצעות של משתמשים אחרים בנוגע לאותה עסקה אושרו.
3.6. בכדי לאפשר רכישה באתר, יחויב המשתמש לפתוח חשבון משתמש. בעזרת חשבון משתמש זה, יוכל המשתמש לבצע פעולות שונות באתר, לרבות, הדפסת השוברים, צפייה ברכישות עבר, שינויי הגדרות המשתמש והעדפותיו וכדומה.
3.7. מועד קבלת ההצעה כפי שנרשם במחשבי החברה הוא המועד הקובע לכל דבר.

4. רישום באתר
4.1. לשם ביצוע רכישה יהיה על המשתמש למלא טופס הרשמה. טופס ההרשמה יכלול את הפרטים הבאים:
• שם פרטי ושם משפחה;
• כתובת דואר אלקטרוני;
• בחירת סיסמא;
• תעודת זהות;
• מספר טלפון;
• פרטי כרטיס אשראי.
4.2
אני מאשר בזאת כי המידע שמסרתי ו/או ייאסף אודותיי במסגרת התקשרותי עם החברה, ישמר במאגר הלקוחות שלה (מס' רישום 991002838) לצורך ניהול השירות ופעילותי בחברה והקשר עימי ולצרכים תפעוליים, שיווקיים וסטטיסטיים, לרבות דיוור ישיר, עיבוד המידע והעברתו לצדדים שלישיים לגביהם אסכים באופן מפורש ולצורך מימוש מטרות אלו ובהתאם לכל דין. ידוע לי כי לא חלה עלי כל חובה חוקית למסור את המידע ומסירתו הינה מרצוני ובהסכמתי.

4.3. הגשת פרטים כוזבים ביודעין הינה עבירה פלילית עפ''י חוק. החברה תהא רשאית לנקוט בכל צעד משפטי כנגד מגיש פרטים כוזבים, כולל פנייה לערכאות בגין נזקים שיגרמו לחברה ו/או מי מטעמה עקב שיבוש פעילות האתר ו/או הליכי המכירה באתר.

5. תשלום
5.1. המחירים המוצגים באתר כוללים מע''מ על-פי הדין אלא אם צוין אחרת במפורש.
5.2. רכישה שאושרה (לאחר שהמשתמש הציע הצעה לרכוש את השובר הרלוונטי) מהווה רכישה של השירות ו/או המוצר, המחייבת בתשלום מלוא הסכום שהוצע על ידי המציע עבור השירות ו/או המוצר.
5.3. החיוב יתבצע באמצעות כרטיס האשראי שאת פרטיו המלאים מסר הרוכש (במידה שלא נמסרו הפרטים המלאים, החברה תהא רשאית לבטל רכישה שאושרה).
5.4. במידה שחברת כרטיסי האשראי תסרב לכבד את התחייבויותיו של הרוכש, תבוטל רכישה שאושרה, המוצר ו/או השירות לא יסופקו, ודמי ביטול כמפורט בסעיף ‏7 יחולו.

6. אספקת המוצרים ו/או השירותים
6.1. אספקת המוצרים והשירותים תבוצע על ידי הספקים ובאחריותם הבלעדית ובהתאם לכל התנאים וההתניות המופיעים בעמוד המכירה של השירות ו/או המוצר ו/או על גבי השובר.
6.2. אספקת השירות ו/או המוצר תהייה תוך הצגת השובר עצמו שיוצג לספק בפרק הזמן שיצוין עליו. ייתכן שבעת מימוש השובר יידרש הרוכש ע"י הספק להציג תעודה מזהה ו/או את אמצעי התשלום בו השתמש בעת הרכישה.
6.3. החברה ו/או הספקים לא יהיו אחראים לכל איחור או עיכוב באספקה ו/או לאי-אספקה שנגרמו כתוצאה מכוח עליון ו/או מאירועים שאינם בשליטתם.

7. ביטול רכישה מצד הרוכש
7.1. כל רוכש רשאי לבטל את העסקה בהתאם להוראות חוק הגנת הצרכן והתקנות שהותקנו על פיו. להלן מספר הוראות רלוונטיות מחוק הגנת הצרכן.
7.2. ביטול ייעשה אך ורק בהודעה בכתב.
7.3. ברכישה של נכס, רשאי הרוכש לבטל את העסקה, מיום עשיית העסקה ועד ארבעה עשר ימים מיום קבלת הנכס או מיום קבלת המסמך המכיל את הפרטים האמורים בסעיף קטן 14ג(ב) לחוק הגנת הצרכן, לפי המאוחר מביניהם.
7.4. ברכישה של שירות, רשאי הרוכש לבטל את העסקה, בתוך ארבעה עשר ימים מיום עשיית העסקה או מיום קבלת מסמך המכיל את הפרטים האמורים בסעיף קטן 14ג(ב) לחוק הגנת הצרכן, לפי המאוחר מביניהם, ובלבד שביטול כאמור ייעשה לפחות 2 ימי עבודה קודם למועד בו השירות אמור להינתן (ובמקרה של הזמנת שרותי הארחה, נסיעה, חופש או בילוי, עד שבעה ימים (שאינם ימי מנוחה) קודם למועד שנקבע למתן השירות).
7.5. רוכש לא רשאי לבטל את העסקה ברכישת פריטים מסוימים כמפורט בסעיף קטן 14ג(ד) לחוק הגנת הצרכן.
7.6. בתוך 14 יום מיום קבלת הודעת הביטול יושב לרוכש הסכום ששולם על ידו בגין השירות ו/או המוצר בניכוי דמי ביטול (לרבות דמי שילוח ואריזה) בשיעור של 5% מסכום העסקה או 100 ש''ח, לפי הנמוך. במקרה של ביטול עסקה עקב פגם או אי התאמה, לא יחויב הרוכש בדמי ביטול כלשהם כאמור בסעיף 14ה לחוק. הוראות חוק הגנת הצרכן נוספות בנוגע לביטול הרכישה מצד הרוכש, לרבות בנוגע לחובה להחזיר המוצר, יחולו גם-כן.

8. ביטול רכישה מצד החברה
8.1. החברה תהא רשאית, על פי שיקול דעתה הבלעדי, בשל כל סיבה, ובכל עת, לבטל או להפסיק עסקה ו/או מכירה, כולה או חלקה, ו/או את פעילות האתר, כולה או חלקה.
8.2. הודעה על ביטול או הפסקה מעין זה תימסר למשתמש או לרוכש, והחברה תימנע מחיוב כרטיס האשראי של הרוכש או תשיב לו כל סכום ששולם בגין השובר, השירותים ו/או המוצרים, ככל ששולם.
8.3. למעט בגין השבת סכום העסקה כאמור, לא תהיה למשתמש או לרוכש כל טענה, תביעה ו/או דרישה כלפי החברה ו/או הספק בגין ביטול העסקה כאמור בסעיף זה.

9. אחריות
9.1. האחריות המלאה והבלעדית בכל הנוגע למוצרים ו/או השירותים חלה על הספק/ים בלבד. החברה (ו/או מי מטעמה) אינה מספקת את השירותים ו/או מוכרת את המוצרים המוצגים באתר ולפיכך אינה נושאת במישרין ו/או בעקיפין באחריות כלשהי לגביהם ו/או לכל מצג לגביהם, לרבות תיאורם כפי שנמסר על ידי הספק/ים. החברה (ו/או מי מטעמה) אינה נושאת במישרין ו/או בעקיפין באחריות כלשהי לנזקים הנובעים ו/או הקשורים בכל דרך שהיא באספקתם או אי אספקתם, תיקונם, הרכבתם ו/או החלפתם של המוצרים ו/או השירותים. החברה (ו/או מי מטעמה) אינה נושאת במישרין או בעקיפין באחריות כלשהי לנזקים הנובעים כתוצאה משימוש ו/או הסתמכות על מידע המתפרסם באתרים חיצוניים, שאליהם ניתן להגיע באמצעות איזה מהשירותים באתר. תמונות המוצרים באתר נועדו להמחשה בלבד. יובהר כי החברה עושה ותעשה כמיטב יכולתה לשתף פעולה עם ספקים אמינים ובעלי מוניטין בלבד.
9.2. החברה (ו/או מי מטעמה) אינה נושאת במישרין ו/או בעקיפין באחריות כלשהי לנזקים הנובעים ו/או הקשורים בכל דרך שהיא בשימוש ו/או בביצועי האתר. החברה (ו/או מי מטעמה) אינה נושאת במישרין ו/או בעקיפין באחריות כלשהי למקרה שבו הצעתו של משתמש לא התקבלה (מכל סיבה שהיא) ו/או לכל בעיה טכנית המונעת ממשתמש מלהגיש הצעה ו/או לעשות כל פעולה אחרת באתר. החברה מתחייבת לעשות כמיטב יכולתה לשמור על פעילות תקינה של האתר.
9.3. בכל מקרה, החברה לא תישא באחריות לפעילות כלשהי של כל גורם אחר שאינו בשליטתה המלאה.

10. סודיות ופרטיות
10.1. כל פרטיו האישים של המשתמש (שם, דואר אלקטרוני וכדומה), יישמרו במאגרי המידע של החברה.
10.2. החברה לא תעביר פרטיו האישיים של המשתמש לאף גורם אחר זולת לספקים וזאת רק לשם השלמת עסקה.
10.3. החברה לא תעשה כל שימוש בפרטים של אמצעי התשלום של המשתמש אלא לביצוע תשלום בגין עסקה אותה ביקש המשתמש לערוך, ופרטים אלו לא יועברו לאף גורם אחר זולת לצורך זה.
10.4. למרות האמור לעיל, החברה תהא רשאית להעביר פרטיו האישיים של משתמש לצד שלישי במקרים בהם המשתמש ביצע מעשה או מחדל הפוגעים ו/או העלולים לפגוע בחברה ו/או בצדדים שלישיים כלשהם, המשתמש עשה שימוש בשירותי החברה לביצוע מעשה בלתי חוקי, אם התקבל בידי החברה צו שיפוטי המורה לה למסור את פרטי המשתמש לצד שלישי וכן בכל מחלוקת או הליכים משפטיים.
10.5. החברה תוכל להשתמש בפרטיו האישיים של המשתמש, ללא זיהוי המשתמש הספציפי, לצורך ניתוח מידע סטטיסטי והצגתו ו/או מסירתו לגורמים אחרים.
10.6. מאחר שמדובר בביצוע פעולות בסביבה מקוונת אין באפשרותה של החברה להבטיח חסינות מוחלטת מפני חדירות למחשביה או חשיפת המידע האגור בידי מבצעי פעולות בלתי חוקיות. אם יעלה בידי צד שלישי לחדור למידע אשר שמור בידי החברה ו/או להשתמש בו לרעה, לא תהיה למשתמש כל טענה, תביעה או דרישה כלפי החברה.
10.7. החברה תהא רשאית לעשות שימוש ב - "עוגיות" (“cookies”) על מנת לספק למשתמש שירות מהיר ויעיל ולחסוך מהמשתמש הצורך להזין את פרטיו האישיים בכל כניסה לאתר.
10.8 המידע שנאסף אודותיך יישמר במאגרי המידע של החברה.

11. דין ושיפוט
11.1. הדין החל על תקנון זה ו/או על כל פעולה ו/או על סכסוך הנובע ממנו, הוא הדין הישראלי בלבד.
11.2. בכל מקרה של מחלוקת, תהא לבתי המשפט (השלום או המחוזי) תל אביב-יפו הסמכות הבלעדית לדון בה.
        </textarea>
        <br /> <br />

        הנני מאשר את תנאי התקנון של החברה
        <input type='hidden' value='0' name='approve'>
        <input id="checkbox" type="checkbox" required name="approve" value="1">
        <br />
        <br />

        <input type="submit" value="
         שלח  " name="save-contract-submit">
    </form>

	<?php 
		$js_links = '<script type="text/javascript" src="js/contract.js"></script>';
		require 'footer.php'; 
	?>